{
  "_name_or_path": "sgarbi/bert-fda-nutrition-ner",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "I-VITAMINS",
    "2": "I-STIMULANTS",
    "3": "I-PROXIMATES",
    "4": "I-PROTEIN",
    "5": "I-PROBIOTICS",
    "6": "I-MINERALS",
    "7": "I-LIPIDS",
    "8": "I-FLAVORING",
    "9": "I-ENZYMES",
    "10": "I-EMULSIFIERS",
    "11": "I-DIETARYFIBER",
    "12": "I-COLORANTS",
    "13": "I-CARBOHYDRATES",
    "14": "I-ANTIOXIDANTS",
    "15": "I-ALCOHOLS",
    "16": "I-ADDITIVES",
    "17": "I-ACIDS",
    "18": "B-VITAMINS",
    "19": "B-STIMULANTS",
    "20": "B-PROXIMATES",
    "21": "B-PROTEIN",
    "22": "B-PROBIOTICS",
    "23": "B-MINERALS",
    "24": "B-LIPIDS",
    "25": "B-FLAVORING",
    "26": "B-ENZYMES",
    "27": "B-EMULSIFIERS",
    "28": "B-DIETARYFIBER",
    "29": "B-COLORANTS",
    "30": "B-CARBOHYDRATES",
    "31": "B-ANTIOXIDANTS",
    "32": "B-ALCOHOLS",
    "33": "B-ADDITIVES",
    "34": "B-ACIDS"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-ACIDS": 34,
    "B-ADDITIVES": 33,
    "B-ALCOHOLS": 32,
    "B-ANTIOXIDANTS": 31,
    "B-CARBOHYDRATES": 30,
    "B-COLORANTS": 29,
    "B-DIETARYFIBER": 28,
    "B-EMULSIFIERS": 27,
    "B-ENZYMES": 26,
    "B-FLAVORING": 25,
    "B-LIPIDS": 24,
    "B-MINERALS": 23,
    "B-PROBIOTICS": 22,
    "B-PROTEIN": 21,
    "B-PROXIMATES": 20,
    "B-STIMULANTS": 19,
    "B-VITAMINS": 18,
    "I-ACIDS": 17,
    "I-ADDITIVES": 16,
    "I-ALCOHOLS": 15,
    "I-ANTIOXIDANTS": 14,
    "I-CARBOHYDRATES": 13,
    "I-COLORANTS": 12,
    "I-DIETARYFIBER": 11,
    "I-EMULSIFIERS": 10,
    "I-ENZYMES": 9,
    "I-FLAVORING": 8,
    "I-LIPIDS": 7,
    "I-MINERALS": 6,
    "I-PROBIOTICS": 5,
    "I-PROTEIN": 4,
    "I-PROXIMATES": 3,
    "I-STIMULANTS": 2,
    "I-VITAMINS": 1,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.44.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
